# pandas Basics

- In this homework assignment, you will practice selecting, sorting, and aggregating data in a DataFrame. 
- Follow each *TODO* instruction to write a Python code snippet with pandas and Numpy. Include the output of each code cell.

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

**TODO 1**
Consider the following Python dictionary `adict`. 

```python
adict = {'state': ['New York', 'California', 'Maryland'], 
         'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}
```

Notation:

- `pop2010`: state's 2010 population (in thousand)
- `pop2018`: state's 2018 population (in thousand)
- `rev2010`: state's 2010 tax revenue (in million USD)
- `rev2018`: state's 2018 tax revenue (in million USD)

Construct a DataFrame `frame` from dictionary `adict`. The row label (index) of each state is its abbreviation, i.e., `NY`, `CA` or `MD`.

In [7]:
#####TODO 1#####
adict = {'state': ['New York', 'California', 'Maryland'], 
         'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}
df=DataFrame(adict)
df

        state  pop2010  pop2018  rev2010  rev2018
0    New York    19378    19542    71545    88541
1  California    37254    39557   112372   175017
2    Maryland     5774     6043    17064    22427

**TODO 2**
It is known that the areas of the three states are 54555, 163695 and 12406 square miles. Add a column `area` with appropriate data to DataFrame `frame`.

In [9]:
#####TODO 2#####
df['area']=[54555,163695,12406]
df

        state  pop2010  pop2018  rev2010  rev2018    area
0    New York    19378    19542    71545    88541   54555
1  California    37254    39557   112372   175017  163695
2    Maryland     5774     6043    17064    22427   12406

**TODO 3** 
Select the first row and the last row of DataFrame `frame`.

In [11]:
#####TODO 3#####
df.iloc[[0,2]]

      state  pop2010  pop2018  rev2010  rev2018   area
0  New York    19378    19542    71545    88541  54555
2  Maryland     5774     6043    17064    22427  12406

**TODO 4**
Select just columns `state`, `pop2018` and `area` from DataFrame `frame`.

In [12]:
#####TODO 4#####
df[['state','pop2018','area']]

        state  pop2018    area
0    New York    19542   54555
1  California    39557  163695
2    Maryland     6043   12406

**TODO 5**
Select the New York state's population data in 2010 and 2018.

In [17]:
#####TODO 5#####
df.loc[[0],['state','pop2010','pop2018']]

      state  pop2010  pop2018
0  New York    19378    19542

**TODO 6**
Show the row labels of the second row and the third row.

In [34]:
#####TODO 6#####
x=list(df.index.values)
print(x[1],x[2])

1 2

**TODO 7**
Select just columns `state`, `rev2010` and `rev2018` of the second row and the third row from DataFrame `frame`.

In [35]:
#####TODO 7#####
df.loc[[1,2],['state','rev2010','rev2018']]

        state  rev2010  rev2018
1  California   112372   175017
2    Maryland    17064    22427

**TODO 8** Select only the rows from DataFrame `frame` with an area greater than 50,000.

In [41]:
#####TODO 8#####
df.iloc[:][df.area >50000]

        state  pop2010  pop2018  rev2010  rev2018    area
0    New York    19378    19542    71545    88541   54555
1  California    37254    39557   112372   175017  163695

**TODO 9** 
Add a column `popchange` to DataFrame `frame`. Assign the percentage change from 2010 to 2018 in each state's population to this new column.

In [52]:
#####TODO 9#####
df['popchange']=((df['pop2018']-df['pop2010'])/df['pop2010'])
df

        state  pop2010  pop2018  rev2010  rev2018    area  popchange
0    New York    19378    19542    71545    88541   54555   0.008463
1  California    37254    39557   112372   175017  163695   0.061819
2    Maryland     5774     6043    17064    22427   12406   0.046588

**TODO 10** 
Sort DataFrame `frame` by the index.

In [53]:
#####TODO 10#####
df.sort_index()

        state  pop2010  pop2018  rev2010  rev2018    area  popchange
0    New York    19378    19542    71545    88541   54555   0.008463
1  California    37254    39557   112372   175017  163695   0.061819
2    Maryland     5774     6043    17064    22427   12406   0.046588

**TODO 11**
Sort DataFrame `frame` by the 2018 population in descending order.

In [55]:
#####TODO 11#####
df.sort_values(by='pop2018')[::-1]

        state  pop2010  pop2018  rev2010  rev2018    area  popchange
1  California    37254    39557   112372   175017  163695   0.061819
0    New York    19378    19542    71545    88541   54555   0.008463
2    Maryland     5774     6043    17064    22427   12406   0.046588

**TODO 12**
Compute the total tax revenue across the three states in DataFrame `frame`.

In [57]:
####TODO 12####
np.sum(df[['rev2010','rev2018']])

rev2010    200981
rev2018    285985
dtype: int64

**TODO 13** In how many states did the tax reveue increase by at least 30%?

In [59]:
#####TODO 13#####
np.sum(((df['rev2018']-df['rev2010'])/df['rev2010'])>=0.3)

2

**TODO 14** 
Return the index of the row with the highest `popchange` value.

In [60]:
#####TODO 14#####
(df.sort_values(by='popchange')[::-1]).head(1)

        state  pop2010  pop2018  rev2010  rev2018    area  popchange
1  California    37254    39557   112372   175017  163695   0.061819

**TODO 15**
Replace Maryland's `popchange` value by `np.NaN`. Then count the number of rows in the DataFrame with one or more missing values.

Hint: use methods `isnull()` and `any(axis = 1)`.

In [66]:
#####TODO 15#####
a=df.replace({'popchange': 2}, np.NaN)
a.isnull

<bound method DataFrame.isnull of         state  pop2010  pop2018  rev2010  rev2018    area  popchange
0    New York    19378    19542    71545    88541   54555   0.008463
1  California    37254    39557   112372   175017  163695   0.061819
2    Maryland     5774     6043    17064    22427   12406   0.046588>